s2.4-multiple-representations-for-abstract-data.org
#+PROPERTY: header-args  :cache yes
#+PROPERTY: header-args+  :exports code
#+PROPERTY: header-args+  :noweb strip-export
#+TITLE: 2.4 Multiple Representations for Abstract Data
#+options: num:nil
** Introduction

Data objects may have several representations, each of which might be useful for different use-cases.

#+begin_quote
... programming systems are often designed by many people working over extended periods of time, subject to requirements that change over time. In such an environment, it is simply not possible for everyone to agree in advance on choices of data representations. So in addition to the data-abstraction barriers that isolate representation from use, we need abstraction barriers that isolate different design choices from each other  and permit different choices to coexist in a single program.
#+end_quote

Way to cope with data that may be represented in different ways is to construct /generic procedures/ - those can operate on data that may be represented in more than one way. A technique for building generic procedures is to work in terms of data objects that have /type tags/, i.e. include explicit information about how they are to be processed.

/Data-directed/ programming - a powerful and convenient implementation strategy for additively assembling systems with generic operations.

** 2.4.1 Representations for Complex Numbers

Unrealistic example for illustrative purposes.

Complex numbers are natrually represented as ordered pairs. The set of complex numbers can be thought of as a two-dimensional space with two orthogonal axes, the "real" axis and the "imaginary" axis. From this point of view, the complex number $z=x+iy$ can be thought of as the point in the plane whose real coordinate is $x$ and whose imaginary coordinate is $y$.

Addition of complex numbers reduces in this representation to addition of coordinates.

When multyplyig complex numbers, it is more natural to think in terms of representing a complex number in polar form, as a magnitude and an angle. The product of two complex numbers is the vector obtained by stretching one complex number by the length of the other and then rotating it through the angle of the other.

Two different representations for complex numbers are appropriate for different operations. From the viewpoint of someone writing a program that uses complex numbers, all operations on complex numbers should be available regardles of which representation is actually used to store data objects.

Data-abstraction strategy: assume the operations on complex numbers are implemented in terms of four selectors: ~real-part~, ~imag-part~, ~magnitude~, and ~angle~. Also assume we have two procedures for constructing complex numbers: ~make-from-real-imag~ and ~make-from-mag-ang~.
These procedures have the property that, for any complex number ~z~, both ~(make-from-real-imag (real-part z) (imag-part z))~ and ~(make-from-mag-ang (magnitude z) (angle z))~ produce complex numbers that are equal to ~z~.

With these in place, implement operations on arithmetic numbers:

#+name: complex-numbers-operations
#+begin_src racket
  (define (add-complex z1 z2)
    (make-from-real-imag
     (+ (real-part z1) (real-part z2))
     (+ (imag-part z1) (imag-part z2))))

  (define (sub-complex z1 z2)
    (make-from-real-imag
     (- (real-part z1) (real-part z2))
     (- (imag-part z1) (imag-part z2))))

  (define (mul-complex z1 z2)
    (make-from-mag-ang
     (* (magnitude z1) (magnitude z2))
     (+ (angle z1) (angle z2))))

  (define (div-complex z1 z2)
    (make-from-mag-ang
     (/ (magnitude z1) (magnitude z2))
     (- (angle z1) (angle z2))))
#+end_src

#+name: complex-numbers-interface-rectangular
#+begin_src racket
  (define (real-part z) (car z))
  (define (imag-part z) (cdr z))
  (define (magnitude z)
    (sqrt (+ (square (real-part z))
	     (square (imag-part z)))))
  (define (angle z)
    (atan (imag-part z) (real-part z)))

  (define (make-from-real-image x y) (cons x y))

  (define (make-from-mag-ang r a)
    (cons (* r (cos a)) (* r (sin a))))
#+end_src

#+name: complex-numbers-interface-polar
#+begin_src racket
  (define (real-part z)
    (* (magnitude z) (cos (angle z))))
  (define (imag-part z)
    (* (magnitude z) (sin (angle z))))
  (define (magnitude z) (car z))
  (define (angle z) (cdr z))

  (define (make-from-real-image x y)
    (cons (sqrt (+ (square x) (square y)))
	  (atan y x)))

  (define (make-from-mag-ang r a) (cons r a))
#+end_src

Data abstraction ensures that the same implementation of operations works with either rectangular or polar  

