s2.4-multiple-representations-for-abstract-data.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-06-23 Fri 14:32 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>2.4 Multiple Representations for Abstract Data</title>
<meta name="author" content="LMG" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">2.4 Multiple Representations for Abstract Data</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org651fdb0">Introduction</a></li>
<li><a href="#org67512ba">2.4.1 Representations for Complex Numbers</a></li>
<li><a href="#org123a654">2.4.2 Tagged data</a></li>
<li><a href="#orge631b20">2.4.3 Data-Directed Programming and Additivity</a>
<ul>
<li><a href="#org781c765">Exercise 2.73 - derivation with data-directed style</a>
<ul>
<li><a href="#orga4b9a43">a. Explain what was done above</a></li>
<li><a href="#org17c9e46">b. Write the procedures for derivatives of sums and products, and the auxiliary code required to install them in the table used by the program above</a></li>
<li><a href="#orge1da719">c. Choose any additional differential rule that you like, such as the one for exponents, and install it in this data-directed system.</a></li>
<li><a href="#org67dda61">d. Indexing procedures</a></li>
</ul>
</li>
<li><a href="#orgef2200d">Exercise 2.74 - Data-directed programming exercise</a>
<ul>
<li><a href="#orgc202576">a. Implement <code>get-record</code></a></li>
<li><a href="#org423edd5">b. Implement <code>get-salary</code></a></li>
<li><a href="#org09d72e1">c. Implement <code>find-employee-record</code></a></li>
<li><a href="#org84d11ac">d. When Insatiable takes over a new company, what changes must be made in order to incorporate the new personnel information into the central system</a></li>
</ul>
</li>
<li><a href="#org32fdcbb">Message passing</a>
<ul>
<li><a href="#orga0a691b">Exercise 2.75 - <code>make-from-mag-ang</code> in message passing style</a></li>
<li><a href="#org2779f2f">Exercise 2.76 - Analysis of required system changes</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org651fdb0" class="outline-2">
<h2 id="org651fdb0">Introduction</h2>
<div class="outline-text-2" id="text-org651fdb0">
<p>
Data objects may have several representations, each of which might be useful for different use-cases.
</p>

<blockquote>
<p>
&#x2026; programming systems are often designed by many people working over extended periods of time, subject to requirements that change over time. In such an environment, it is simply not possible for everyone to agree in advance on choices of data representations. So in addition to the data-abstraction barriers that isolate representation from use, we need abstraction barriers that isolate different design choices from each other  and permit different choices to coexist in a single program.
</p>
</blockquote>

<p>
Way to cope with data that may be represented in different ways is to construct <i>generic procedures</i> - those can operate on data that may be represented in more than one way. A technique for building generic procedures is to work in terms of data objects that have <i>type tags</i>, i.e. include explicit information about how they are to be processed.
</p>

<p>
<i>Data-directed</i> programming - a powerful and convenient implementation strategy for additively assembling systems with generic operations.
</p>
</div>
</div>

<div id="outline-container-org67512ba" class="outline-2">
<h2 id="org67512ba">2.4.1 Representations for Complex Numbers</h2>
<div class="outline-text-2" id="text-org67512ba">
<p>
Unrealistic example for illustrative purposes.
</p>

<p>
Complex numbers are natrually represented as ordered pairs. The set of complex numbers can be thought of as a two-dimensional space with two orthogonal axes, the "real" axis and the "imaginary" axis. From this point of view, the complex number \(z=x+iy\) can be thought of as the point in the plane whose real coordinate is \(x\) and whose imaginary coordinate is \(y\).
</p>

<p>
Addition of complex numbers reduces in this representation to addition of coordinates.
</p>

<p>
When multyplyig complex numbers, it is more natural to think in terms of representing a complex number in polar form, as a magnitude and an angle. The product of two complex numbers is the vector obtained by stretching one complex number by the length of the other and then rotating it through the angle of the other.
</p>

<p>
Two different representations for complex numbers are appropriate for different operations. From the viewpoint of someone writing a program that uses complex numbers, all operations on complex numbers should be available regardles of which representation is actually used to store data objects.
</p>

<p>
Data-abstraction strategy: assume the operations on complex numbers are implemented in terms of four selectors: <code>real-part</code>, <code>imag-part</code>, <code>magnitude</code>, and <code>angle</code>. Also assume we have two procedures for constructing complex numbers: <code>make-from-real-imag</code> and <code>make-from-mag-ang</code>.
These procedures have the property that, for any complex number <code>z</code>, both <code>(make-from-real-imag (real-part z) (imag-part z))</code> and <code>(make-from-mag-ang (magnitude z) (angle z))</code> produce complex numbers that are equal to <code>z</code>.
</p>

<p>
With these in place, implement operations on arithmetic numbers:
</p>

<div class="org-src-container">
<pre class="src src-racket" id="orgc0ed096">(define (add-complex z1 z2)
  (make-from-real-imag
   (+ (real-part z1) (real-part z2))
   (+ (imag-part z1) (imag-part z2))))

(define (sub-complex z1 z2)
  (make-from-real-imag
   (- (real-part z1) (real-part z2))
   (- (imag-part z1) (imag-part z2))))

(define (mul-complex z1 z2)
  (make-from-mag-ang
   (* (magnitude z1) (magnitude z2))
   (+ (angle z1) (angle z2))))

(define (div-complex z1 z2)
  (make-from-mag-ang
   (/ (magnitude z1) (magnitude z2))
   (- (angle z1) (angle z2))))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-racket" id="org48c4b6c">(define (real-part z) (car z))
(define (imag-part z) (cdr z))
(define (magnitude z)
  (sqrt (+ (square (real-part z))
	   (square (imag-part z)))))
(define (angle z)
  (atan (imag-part z) (real-part z)))

(define (make-from-real-image x y) (cons x y))

(define (make-from-mag-ang r a)
  (cons (* r (cos a)) (* r (sin a))))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-racket" id="org77f7ee4">(define (real-part z)
  (* (magnitude z) (cos (angle z))))
(define (imag-part z)
  (* (magnitude z) (sin (angle z))))
(define (magnitude z) (car z))
(define (angle z) (cdr z))

(define (make-from-real-image x y)
  (cons (sqrt (+ (square x) (square y)))
	(atan y x)))

(define (make-from-mag-ang r a) (cons r a))
</pre>
</div>

<p>
Data abstraction ensures that the same implementation of operations works with either rectangular or polar  
</p>
</div>
</div>
