s2.4-multiple-representations-for-abstract-data.org
** 2.4.2 Tagged data

Using "the principle of least commitment" we can use either of representations, delaying the choice of concrete representation to the last moment.
Even more extreme version of the principle is to allow to use both representations in the user code. The problem is it's impossible to know whether (3 5) is a rectangular or polar representation. This problem can be solved by including an explicit /type tag/ into the representation, e.g. ~rectangular~ or ~polar~. Then when we need to manipulate a complex number we can use that tag to decide which selector to apply.

In order to manipulate tagged data, we will assume that we have procedures ~type-tag~ and ~contents~ that extract from a data object that tag and acutal contents. We will also postulate the procedure ~attach-tag~ that takes a tag and contents and produces tagged data object.

#+name: type-tags-interface
#+begin_src racket
  (define (attach-tag type-tag contents)
    (cons type-tag contents))

  (define (type-tag datum)
    (if (pair? datum)
	(car datum)
	(error "Bad tagged datum -- TYPE-ARG" datum)))

  (define (contents datum)
    (if (pair? datum)
	(cdr datum)
	(error "Bad tagged datum -- CONTENTS" datum)))
#+end_src

#+name: complex-number-tag-queries
#+begin_src racket
  (define (rectangular? z)
    (eq? (type-tag z) 'rectangular))

  (define (polar? z)
    (eq? (type-tag z) 'polar))
#+end_src

Using tag queries, interface implementations can be udpated to allow coexistence:

#+begin_src python
  def real_part_rectangular(z):
      return car(z)

  def sum(n):
      s = 0
      for i in range(n):
	  s += i
      return s
#+end_src


#+begin_src racket
  (define (sum n)
    (if (= n 0)
	0
	(+ n (sum (- n 1)))))

  (define (++ xs ys)
    (if (null? xs)
	ys
	(cons (first xs)
	      (++ (rest xs) ys))))
#+end_src

#+name: complex-numbers-interface
#+begin_src racket
  (define (real-part-rectangular z) (car z))
  (define (imag-part-rectangular z) (cdr z))
  (define (magnitude-rectangular z)
    (sqrt (+ (square (real-part-rectangular z))
	     (square (imag-part-rectangular z)))))
  (define (angle-rectangular z)
    (atan (imag-part-rectangular z) (real-part-rectangular z)))

  (define (make-from-real-image-rectangular x y)
    (attach-tag 'rectangular (cons x y)))

  (define (make-from-mag-ang-rectangular r a)
    (attach-tag 'rectangular (cons (* r (cos a)) (* r (sin a)))))


  (define (real-part-polar z)
    (* (magnitude-polar z) (cos (angle-polar z))))
  (define (imag-part-polar z)
    (* (magnitude-polar z) (sin (angle-polar z))))
  (define (magnitude-polar z) (car z))
  (define (angle-polar z) (cdr z))

  (define (make-from-real-image-polar x y)
    (attach-tag 'polar (cons (sqrt (+ (square x) (square y)))
	   (atan y x))))

  (define (make-from-mag-ang-polar r a)
    (attach-tag 'polar (cons r a)))


  (define (real-part z)
    (cond ((rectangular? z)
	   (real-part-rectangular (contents z)))
	  ((polar? z)
	   (real-part-polar (contents z)))
	  (else
	   (error "Unknown type -- REAL-PART" z))))
  (define (imag-part z)
    (cond ((rectangular? z)
	   (imag-part-rectangular (contents z)))
	  ((polar? z)
	   (imag-part-polar (contents z)))
	  (else
	   (error "Unknown type -- IMAG-PART" z))))
  (define (magnitude z)
    (cond ((rectangular? z)
	   (magnitude-rectangular (contents z)))
	  ((polar? z)
	   (magnitude-polar (contents z)))
	  (else
	   (error "Unknown type -- MAGNITUDE" z))))
  (define (angle z)
    (cond ((rectangular? z)
	   (angle-rectangular (contents z)))
	  ((polar? z)
	   (angle-polar (contents z)))
	  (else
	   (error "Unknown type -- ANGLE" z))))

  (define (make-from-real-imag x y)
    (make-from-real-image-rectangular x y))

  (define (make-from-mag-ang r a)
    (make-from-mag-ang-polar r a))
#+end_src


Note that the implementations for polar and rectangulare representations are relatively independent, and do not intersect in naming space.

Note that the constructors of concrete implementations produce tagged data, but the selectors operate on untagged data. Routing layer calls ~contents~ before passing representation to selectors.

