s2.4-multiple-representations-for-abstract-data.org
** 2.4.3 Data-Directed Programming and Additivity

/Dispatching on type/ - general strategy of selecting a specific procedure based on the type of the datum.

Weaknesses of implementation in 2.4.2:
- generic interface procedures must know about implementation procedures
- name uniqueness should be maintaned

Underlying issue can be fixed by making the implementation of generic interfaces /additive/.

/Data-directed programming/ rationale: set of generic functions for a set of possible types can be represented as a 2D table - for each type there should be an implementation for each function.
E.g. for the selectors of complex numbers:

|           | Polar           | Rectangular           |
| real-part | real-part-polar | real-part-rectangular |
| imag-part | imag-part-polar | imag-part-rectangular |
| magnitude | magnitude-polar | magnitude-rectangular |
| angle     | angle-polar     | angle-rectangular     |

/Data-directed programming/ is the technique of designing programs to work with such a table directly.

To implement, assume we have ~(put <op> <type> <item>)~ that will put an item into a table for given op and type, and ~(get <op> <type>)~ that will fetch corresponding item, or return false if not found.

#+name: rectangular-package
#+begin_src racket
  (define (install-rectangular-package)
    (define (real-part z) (car z))
    (define (imag-part z) (cdr z))
    (define (make-from-real-imag x y) (cons x y))
    (define (magnitude z)
      (sqrt (+ (square (real-part z))
	       (square (imag-part z)))))
    (define (angle z)
      (atan (imag-part z) (real-part z)))
    (define (make-from-mag-ang r a)
      (cons (* r (cos a)) (* r (sin a))))

    (define (tag x) (attach-tag 'rectangular x))
    (put 'real-part '(rectangular) real-part)
    (put 'imag-part '(rectangular) imag-part)
    (put 'magnitude '(rectangular) magnitude)
    (put 'angle '(rectangular) angle)
    (put 'make-from-real-imag 'rectangular
	 (lambda (x y) (tag (make-from-real-imag x y))))
    (put 'make-from-mag-ang 'rectangular
	 (lambda (r a) (tag (make-from-mag-ang r a)))))
#+end_src

#+name: polar-package
#+begin_src racket
  (define (install-polar-package)
    (define (real-part z)
      (* (magnitude z) (cos (angle z))))
    (define (imag-part z)
      (* (magnitude z) (sin (angle z))))
    (define (make-from-real-imag x y)
      (cons (sqrt (+ (square x) (square y)))
	    (atan y x)))
    (define (magnitude z) (car z))
    (define (angle z) (cdr z))
    (define (make-from-mag-ang r a)
      (cons r a))

    (define (tag x) (attach-tag 'polar x))
    (put 'real-part '(polar) real-part)
    (put 'imag-part '(polar) imag-part)
    (put 'magnitude '(polar) magnitude)
    (put 'angle '(polar) angle)
    (put 'make-from-real-imag 'polar
	 (lambda (x y) (tag (make-from-real-imag x y))))
    (put 'make-from-mag-ang 'polar
	 (lambda (r a) (tag (make-from-mag-ang r a)))))
#+end_src

#+begin_src racket
  (define (apply-generic op . args)
    (let ((type-tags (map type-tag args)))
      (let ((proc (get op type-tags)))
	(if proc
	    (apply proc (map contents args))
	    (error
	     "No method for these types -- APPLY-GENERIC"
	     (list op type-tags))))))

  (define (real-part z) (apply-generic 'real-part z))
  (define (imag-part z) (apply-generic 'imag-part z))
  (define (magnitude z) (apply-generic 'magnitude z))
  (define (angle z) (apply-generic 'angle z))

  (define (make-from-real-imag x y)
    ((get 'make-from-real-imag 'rectangular) x y))

  (define (make-from-mag-ang r a)
    ((get 'make-from-mag-ang 'polar) r a))
#+end_src

*** Exercise 2.73 - derivation with data-directed style

We can regard this program as performing dispatch on the type of the expression to be differentiated. In this case, type tag is the operator symbol (e.g. '+ or '*) and the operation to be performed is 'deriv:
#+name: ex2.73-deriv-data-directed
#+begin_src racket
  (define (deriv exp var)
    (cond ((number? exp) 0)
	  ((variable? exp) (if (same-variable? exp var) 1 0))
	  (else
	   ((get 'deriv (operator exp)) (operands exp) var))))

  (define (operator exp) (car exp))
  (define (operands exp) (cdr exp))
#+end_src
 
**** a. Explain what was done above
Moved the derivation rules out into separate functions that should be registered with the dispatch table.

Operation signature is ~(derive-<name> operands var)~.

***** Why can't we assimilate the predicates ~number?~ and ~same-variable?~ into the data-directed dispatch?

We can, with appropriate definitions for ~operator~ and ~operands~, e.g.:
#+begin_src racket
  (define (operator exp)
    (cond ((number? exp) 'const)
	  ((variable? exp) 'var)
	  (else (car exp))))

  (define (operands exp)
    (cond ((or (number? exp) (variable? exp)) exp)
	  (else (cdr exp))))
#+end_src

Or, with marking numbers and variables explicitly in expressions, as ~(const 10)~ and ~(var x)~.

**** b. Write the procedures for derivatives of sums and products, and the auxiliary code required to install them in the table used by the program above

#+begin_src racket
  (define (deriv-sum operands var)
    (apply make-sum
	   (map (lambda (exp) (deriv exp var))
		operands)))
  (define (deriv-product operands var)
    (if (not (= (length operands) 2))
	(error "Expected exactly 2 operands -- DERIV-PRODUCT" operands)
	(make-sum (make-product
		   (car operands)
		   (deriv (cadr operands) var))
		  (make-product
		   (deriv (car operands) var)
		   (cadr operands)))))
  (put 'deriv '+ deriv-sum)
  (put 'deriv '* deriv-product)
#+end_src

**** c. Choose any additional differential rule that you like, such as the one for exponents, and install it in this data-directed system.

#+begin_src racket
  (define (deriv-exp operands var)
    (make-product
     (cadr operands)
     (make-product
      (make-exponentiation (car operands) (- (cadr operands) 1))
      (deriv (car operands) var))))

  (put 'deriv '** deriv-exp)
#+end_src

**** d. Indexing procedures

#+begin_quote
In this simple algebraic manipulator the type of an expression is the algebraic operator that binds it together. Suppose, however, we indexed procedures in the opposite way, so that the dispatch line in ~deriv~ looked like

~((get (operator exp) 'deriv) (operands exp) var)~

What corresponding changes to the derivative system are required?
#+end_quote

Swap first two arguments in all ~put~ calls.

