s2.4-multiple-representations-for-abstract-data.html

<div id="outline-container-orge631b20" class="outline-2">
<h2 id="orge631b20">2.4.3 Data-Directed Programming and Additivity</h2>
<div class="outline-text-2" id="text-orge631b20">
<p>
<i>Dispatching on type</i> - general strategy of selecting a specific procedure based on the type of the datum.
</p>

<p>
Weaknesses of implementation in 2.4.2:
</p>
<ul class="org-ul">
<li>generic interface procedures must know about implementation procedures</li>
<li>name uniqueness should be maintaned</li>
</ul>

<p>
Underlying issue can be fixed by making the implementation of generic interfaces <i>additive</i>.
</p>

<p>
<i>Data-directed programming</i> rationale: set of generic functions for a set of possible types can be represented as a 2D table - for each type there should be an implementation for each function.
E.g. for the selectors of complex numbers:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Polar</td>
<td class="org-left">Rectangular</td>
</tr>

<tr>
<td class="org-left">real-part</td>
<td class="org-left">real-part-polar</td>
<td class="org-left">real-part-rectangular</td>
</tr>

<tr>
<td class="org-left">imag-part</td>
<td class="org-left">imag-part-polar</td>
<td class="org-left">imag-part-rectangular</td>
</tr>

<tr>
<td class="org-left">magnitude</td>
<td class="org-left">magnitude-polar</td>
<td class="org-left">magnitude-rectangular</td>
</tr>

<tr>
<td class="org-left">angle</td>
<td class="org-left">angle-polar</td>
<td class="org-left">angle-rectangular</td>
</tr>
</tbody>
</table>

<p>
<i>Data-directed programming</i> is the technique of designing programs to work with such a table directly.
</p>

<p>
To implement, assume we have <code>(put &lt;op&gt; &lt;type&gt; &lt;item&gt;)</code> that will put an item into a table for given op and type, and <code>(get &lt;op&gt; &lt;type&gt;)</code> that will fetch corresponding item, or return false if not found.
</p>

<div class="org-src-container">
<pre class="src src-racket" id="orge89e747">(define (install-rectangular-package)
  (define (real-part z) (car z))
  (define (imag-part z) (cdr z))
  (define (make-from-real-imag x y) (cons x y))
  (define (magnitude z)
    (sqrt (+ (square (real-part z))
	     (square (imag-part z)))))
  (define (angle z)
    (atan (imag-part z) (real-part z)))
  (define (make-from-mag-ang r a)
    (cons (* r (cos a)) (* r (sin a))))

  (define (tag x) (attach-tag 'rectangular x))
  (put 'real-part '(rectangular) real-part)
  (put 'imag-part '(rectangular) imag-part)
  (put 'magnitude '(rectangular) magnitude)
  (put 'angle '(rectangular) angle)
  (put 'make-from-real-imag 'rectangular
       (lambda (x y) (tag (make-from-real-imag x y))))
  (put 'make-from-mag-ang 'rectangular
       (lambda (r a) (tag (make-from-mag-ang r a)))))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-racket" id="org8c5fe06">(define (install-polar-package)
  (define (real-part z)
    (* (magnitude z) (cos (angle z))))
  (define (imag-part z)
    (* (magnitude z) (sin (angle z))))
  (define (make-from-real-imag x y)
    (cons (sqrt (+ (square x) (square y)))
	  (atan y x)))
  (define (magnitude z) (car z))
  (define (angle z) (cdr z))
  (define (make-from-mag-ang r a)
    (cons r a))

  (define (tag x) (attach-tag 'polar x))
  (put 'real-part '(polar) real-part)
  (put 'imag-part '(polar) imag-part)
  (put 'magnitude '(polar) magnitude)
  (put 'angle '(polar) angle)
  (put 'make-from-real-imag 'polar
       (lambda (x y) (tag (make-from-real-imag x y))))
  (put 'make-from-mag-ang 'polar
       (lambda (r a) (tag (make-from-mag-ang r a)))))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-racket">(define (apply-generic op . args)
  (let ((type-tags (map type-tag args)))
    (let ((proc (get op type-tags)))
      (if proc
	  (apply proc (map contents args))
	  (error
	   "No method for these types -- APPLY-GENERIC"
	   (list op type-tags))))))

(define (real-part z) (apply-generic 'real-part z))
(define (imag-part z) (apply-generic 'imag-part z))
(define (magnitude z) (apply-generic 'magnitude z))
(define (angle z) (apply-generic 'angle z))

(define (make-from-real-imag x y)
  ((get 'make-from-real-imag 'rectangular) x y))

(define (make-from-mag-ang r a)
  ((get 'make-from-mag-ang 'polar) r a))
</pre>
</div>
</div>

<div id="outline-container-org781c765" class="outline-3">
<h3 id="org781c765">Exercise 2.73 - derivation with data-directed style</h3>
<div class="outline-text-3" id="text-org781c765">
<p>
We can regard this program as performing dispatch on the type of the expression to be differentiated. In this case, type tag is the operator symbol (e.g. '+ or '*) and the operation to be performed is 'deriv:
</p>
<div class="org-src-container">
<pre class="src src-racket" id="org266c8dc">(define (deriv exp var)
  (cond ((number? exp) 0)
	((variable? exp) (if (same-variable? exp var) 1 0))
	(else
	 ((get 'deriv (operator exp)) (operands exp) var))))

(define (operator exp) (car exp))
(define (operands exp) (cdr exp))
</pre>
</div>
</div>

<div id="outline-container-orga4b9a43" class="outline-4">
<h4 id="orga4b9a43">a. Explain what was done above</h4>
<div class="outline-text-4" id="text-orga4b9a43">
<p>
Moved the derivation rules out into separate functions that should be registered with the dispatch table.
</p>

<p>
Operation signature is <code>(derive-&lt;name&gt; operands var)</code>.
</p>
</div>

<ul class="org-ul">
<li><a id="org9c51983"></a>Why can't we assimilate the predicates <code>number?</code> and <code>same-variable?</code> into the data-directed dispatch?<br />
<div class="outline-text-5" id="text-org9c51983">
<p>
We can, with appropriate definitions for <code>operator</code> and <code>operands</code>, e.g.:
</p>
<div class="org-src-container">
<pre class="src src-racket">(define (operator exp)
  (cond ((number? exp) 'const)
	((variable? exp) 'var)
	(else (car exp))))

(define (operands exp)
  (cond ((or (number? exp) (variable? exp)) exp)
	(else (cdr exp))))
</pre>
</div>

<p>
Or, with marking numbers and variables explicitly in expressions, as <code>(const 10)</code> and <code>(var x)</code>.
</p>
</div>
</li>
</ul>
</div>

<div id="outline-container-org17c9e46" class="outline-4">
<h4 id="org17c9e46">b. Write the procedures for derivatives of sums and products, and the auxiliary code required to install them in the table used by the program above</h4>
<div class="outline-text-4" id="text-org17c9e46">
<div class="org-src-container">
<pre class="src src-racket">(define (deriv-sum operands var)
  (apply make-sum
	 (map (lambda (exp) (deriv exp var))
	      operands)))
(define (deriv-product operands var)
  (if (not (= (length operands) 2))
      (error "Expected exactly 2 operands -- DERIV-PRODUCT" operands)
      (make-sum (make-product
		 (car operands)
		 (deriv (cadr operands) var))
		(make-product
		 (deriv (car operands) var)
		 (cadr operands)))))
(put 'deriv '+ deriv-sum)
(put 'deriv '* deriv-product)
</pre>
</div>
</div>
</div>

<div id="outline-container-orge1da719" class="outline-4">
<h4 id="orge1da719">c. Choose any additional differential rule that you like, such as the one for exponents, and install it in this data-directed system.</h4>
<div class="outline-text-4" id="text-orge1da719">
<div class="org-src-container">
<pre class="src src-racket">(define (deriv-exp operands var)
  (make-product
   (cadr operands)
   (make-product
    (make-exponentiation (car operands) (- (cadr operands) 1))
    (deriv (car operands) var))))

(put 'deriv '** deriv-exp)
</pre>
</div>
</div>
</div>

<div id="outline-container-org67dda61" class="outline-4">
<h4 id="org67dda61">d. Indexing procedures</h4>
<div class="outline-text-4" id="text-org67dda61">
<blockquote>
<p>
In this simple algebraic manipulator the type of an expression is the algebraic operator that binds it together. Suppose, however, we indexed procedures in the opposite way, so that the dispatch line in <code>deriv</code> looked like
</p>

<p>
<code>((get (operator exp) 'deriv) (operands exp) var)</code>
</p>

<p>
What corresponding changes to the derivative system are required?
</p>
</blockquote>

<p>
Swap first two arguments in all <code>put</code> calls.
</p>
</div>
</div>
</div>
