s2.4-multiple-representations-for-abstract-data.org
*** Exercise 2.74 - Data-directed programming exercise

Company consists of a large number of independent divisions.
Data structures vary from division to division.
Headquarters need to query data, while maintaining existin autonomy of the divisions.

Concrete example:
Assume each division's personnel records consists of a single file, which contains a set of records keyed on employees' names.
The structure of the set varies from division to division. Furthermore, each employee's record is itself a set (structured differently from division to division) that contains information keyed under identifiers such as ~address~ and ~salary~.

**** a. Implement ~get-record~
Retrieves a specified employee's record from a specified personnel file. The procedure should be applicable to any division's file.

#+begin_src racket
  ;; (define (get-record division employee)
  ;;   (let ((div-get-records (get division 'get-records))
  ;; 	     (div-get-record (get division 'get-record)))
  ;;     (let ((records (div-get-records)))
  ;;       (div-get-record records employee))))

  ;; (define (get-record division employee)
  ;;   (let ((div-get-record (get division 'get-record)))
  ;;     (div-get-record employee)))

  ;; (define (get-record division-file employee-name division)
  ;;   (let ((div-get-record (get division 'get-record)))
  ;;     (div-get-record division-file employee-name)))

  (define (get-record employee-name division-file)
    (let ((div-get-record (get (division division-file) 'get-record)))
      (div-get-record division-file employee-name)))
#+end_src

***** Explain how the individual divisons' files should be structured. In particular, what type information must be supplied?

~division-file~ should expose the division identifier, so that appropriate division's ~get-record~ function can be retrieved from the dispatch table.

**** b. Implement ~get-salary~
Returns the salary information from a given employee's record from any divison's personnel file.

#+begin_src racket
  ;; (define (get-salary division employee)
  ;;   (let ((div-get-record-field (get division 'get-record-field)))
  ;;     (get-record-field
  ;;      (get-record division employee)
  ;;      'salary)))

  (define (get-salary record)
    (let ((div-get-salary (get (division record) 'get-salary)))
      (div-get-salary record)))
#+end_src

***** How should the record be structured in order to make this operation work?

~record~ should expose the division identifier, so that appropriate division's ~get-salary~ implementation can be retrieved from the dispatch table.

**** c. Implement ~find-employee-record~
Search all divisions' files for the record of a given employee and return the record.

#+begin_src racket
  (define (find-employee-record employee-name division-files)
    (if (null? division-files)
	false
	(let ((record (get-record employee-name (car division-files))))
	  (if (not record)
	      (find-employee-record employee-name (cdr division-files))
	      record))))
#+end_src

**** d. When Insatiable takes over a new company, what changes must be made in order to incorporate the new personnel information into the central system

- A new set of "adapter" functions should be implemented and registered with the dispatch table under the division identifier, such as:
  - ~get-record~
  - ~get-salary~
  - ~find-employee-record~
- new company file and record data structures to expose division identifier through the ~division~ selector


*** Message passing

The key idea of data-directed programming is to handle generic operations by dealing explicitely with operation-and-type tables. Style used in 2.4.2 decomposes the table into rows, each operation takes care of its own dispatching.

An alternative implementation strategy is to decompose the table into columns and instead of using "intelligent operations" that dispatch on data types, to work with "intelligent data objects" that dispatch on operation names.

#+begin_src racket
  (define (make-from-real-imag x y)
    (define (dispatch op)
      (cond ((eq? op 'real-part) x)
	    ((eq? op 'imag-part) y)
	    ((eq? op 'magnitutde)
	     (sqrt (+ (square x) (square y))))
	    ((eq? op 'angle) (atan y x))
	    (else
	     (error "Unknown op -- MAKE-FROM-REAL-IMAG" op))))
    dispatch)

  (define (apply-generic op arg) (arg op))
#+end_src

This style of programming is called /message passing/ (data object receives requested operation as a "message").

**** Exercise 2.75 - ~make-from-mag-ang~ in message passing style

#+begin_src racket
  (define (make-from-mag-ang r a)
    (define (dispatch op)
      (cond ((eq? op 'real-part)
	     (* r (cos a)))
	    ((eq? op 'imag-part)
	     (* r (sin a)))
	    ((eq? op 'magnitutde) r)
	    ((eq? op 'angle) a)
	    (else
	     (error "Unknown op -- MAKE-FROM-MAG-ANG" op))))
    dispatch)
#+end_src

**** Exercise 2.76 - Analysis of required system changes

Changes that must be made to a system in order to add new types or new operations for each of the three strategies:
- generic operations with explicit dispatch
  - new type T
    - implement the set of concrete opertaions for type T
    - update every generic operation with new dispatch branch for type T
    - add new "generic" constructor for type T
    - implement constructor for each type S with T_constructure signature
  - new operation P
    - for every type T, add a concrete implementation for P_T
    - add a new generic operation P that dispatches to concrete operation based on type
- data-directed programming
  - new type T
    - implement the set of concrete operations for type T and register them in the dispatch table
    - add a new "generic" constructor for type T      
    - for every type T, implement constructors with the T_constructor signature
  - new operation P
    - for every type T, add a concrete operation P_T and register it with the dispatch table as 'P
    - add a new generic opertaion P that simply searches 'P in the dispatch table to locate implementation
- message passing
  - new type T
    - implement the set of concrete operations for type T under T_constructor
  - new operation P
    - for every type T, add a concrete implementation for P_T (it will automatically be available via apply-generic through 'P)

When new types are added often message passing works best.
When new operations are added often, either message passing or data-directed programming works.
