s2.4-multiple-representations-for-abstract-data.html

<div id="outline-container-orgef2200d" class="outline-3">
<h3 id="orgef2200d">Exercise 2.74 - Data-directed programming exercise</h3>
<div class="outline-text-3" id="text-orgef2200d">
<p>
Company consists of a large number of independent divisions.
Data structures vary from division to division.
Headquarters need to query data, while maintaining existin autonomy of the divisions.
</p>

<p>
Concrete example:
Assume each division's personnel records consists of a single file, which contains a set of records keyed on employees' names.
The structure of the set varies from division to division. Furthermore, each employee's record is itself a set (structured differently from division to division) that contains information keyed under identifiers such as <code>address</code> and <code>salary</code>.
</p>
</div>

<div id="outline-container-orgc202576" class="outline-4">
<h4 id="orgc202576">a. Implement <code>get-record</code></h4>
<div class="outline-text-4" id="text-orgc202576">
<p>
Retrieves a specified employee's record from a specified personnel file. The procedure should be applicable to any division's file.
</p>

<div class="org-src-container">
<pre class="src src-racket">;; (define (get-record division employee)
;;   (let ((div-get-records (get division 'get-records))
;; 	     (div-get-record (get division 'get-record)))
;;     (let ((records (div-get-records)))
;;       (div-get-record records employee))))

;; (define (get-record division employee)
;;   (let ((div-get-record (get division 'get-record)))
;;     (div-get-record employee)))

;; (define (get-record division-file employee-name division)
;;   (let ((div-get-record (get division 'get-record)))
;;     (div-get-record division-file employee-name)))

(define (get-record employee-name division-file)
  (let ((div-get-record (get (division division-file) 'get-record)))
    (div-get-record division-file employee-name)))
</pre>
</div>
</div>

<ul class="org-ul">
<li><a id="orge621cdc"></a>Explain how the individual divisons' files should be structured. In particular, what type information must be supplied?<br />
<div class="outline-text-5" id="text-orge621cdc">
<p>
<code>division-file</code> should expose the division identifier, so that appropriate division's <code>get-record</code> function can be retrieved from the dispatch table.
</p>
</div>
</li>
</ul>
</div>

<div id="outline-container-org423edd5" class="outline-4">
<h4 id="org423edd5">b. Implement <code>get-salary</code></h4>
<div class="outline-text-4" id="text-org423edd5">
<p>
Returns the salary information from a given employee's record from any divison's personnel file.
</p>

<div class="org-src-container">
<pre class="src src-racket">;; (define (get-salary division employee)
;;   (let ((div-get-record-field (get division 'get-record-field)))
;;     (get-record-field
;;      (get-record division employee)
;;      'salary)))

(define (get-salary record)
  (let ((div-get-salary (get (division record) 'get-salary)))
    (div-get-salary record)))
</pre>
</div>
</div>

<ul class="org-ul">
<li><a id="org5b25630"></a>How should the record be structured in order to make this operation work?<br />
<div class="outline-text-5" id="text-org5b25630">
<p>
<code>record</code> should expose the division identifier, so that appropriate division's <code>get-salary</code> implementation can be retrieved from the dispatch table.
</p>
</div>
</li>
</ul>
</div>

<div id="outline-container-org09d72e1" class="outline-4">
<h4 id="org09d72e1">c. Implement <code>find-employee-record</code></h4>
<div class="outline-text-4" id="text-org09d72e1">
<p>
Search all divisions' files for the record of a given employee and return the record.
</p>

<div class="org-src-container">
<pre class="src src-racket">(define (find-employee-record employee-name division-files)
  (if (null? division-files)
      false
      (let ((record (get-record employee-name (car division-files))))
	(if (not record)
	    (find-employee-record employee-name (cdr division-files))
	    record))))
</pre>
</div>
</div>
</div>

<div id="outline-container-org84d11ac" class="outline-4">
<h4 id="org84d11ac">d. When Insatiable takes over a new company, what changes must be made in order to incorporate the new personnel information into the central system</h4>
<div class="outline-text-4" id="text-org84d11ac">
<ul class="org-ul">
<li>A new set of "adapter" functions should be implemented and registered with the dispatch table under the division identifier, such as:
<ul class="org-ul">
<li><code>get-record</code></li>
<li><code>get-salary</code></li>
<li><code>find-employee-record</code></li>
</ul></li>
<li>new company file and record data structures to expose division identifier through the <code>division</code> selector</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-org32fdcbb" class="outline-3">
<h3 id="org32fdcbb">Message passing</h3>
<div class="outline-text-3" id="text-org32fdcbb">
<p>
The key idea of data-directed programming is to handle generic operations by dealing explicitely with operation-and-type tables. Style used in 2.4.2 decomposes the table into rows, each operation takes care of its own dispatching.
</p>

<p>
An alternative implementation strategy is to decompose the table into columns and instead of using "intelligent operations" that dispatch on data types, to work with "intelligent data objects" that dispatch on operation names.
</p>

<div class="org-src-container">
<pre class="src src-racket">(define (make-from-real-imag x y)
  (define (dispatch op)
    (cond ((eq? op 'real-part) x)
	  ((eq? op 'imag-part) y)
	  ((eq? op 'magnitutde)
	   (sqrt (+ (square x) (square y))))
	  ((eq? op 'angle) (atan y x))
	  (else
	   (error "Unknown op -- MAKE-FROM-REAL-IMAG" op))))
  dispatch)

(define (apply-generic op arg) (arg op))
</pre>
</div>

<p>
This style of programming is called <i>message passing</i> (data object receives requested operation as a "message").
</p>
</div>

<div id="outline-container-orga0a691b" class="outline-4">
<h4 id="orga0a691b">Exercise 2.75 - <code>make-from-mag-ang</code> in message passing style</h4>
<div class="outline-text-4" id="text-orga0a691b">
<div class="org-src-container">
<pre class="src src-racket">(define (make-from-mag-ang r a)
  (define (dispatch op)
    (cond ((eq? op 'real-part)
	   (* r (cos a)))
	  ((eq? op 'imag-part)
	   (* r (sin a)))
	  ((eq? op 'magnitutde) r)
	  ((eq? op 'angle) a)
	  (else
	   (error "Unknown op -- MAKE-FROM-MAG-ANG" op))))
  dispatch)
</pre>
</div>
</div>
</div>

<div id="outline-container-org2779f2f" class="outline-4">
<h4 id="org2779f2f">Exercise 2.76 - Analysis of required system changes</h4>
<div class="outline-text-4" id="text-org2779f2f">
<p>
Changes that must be made to a system in order to add new types or new operations for each of the three strategies:
</p>
<ul class="org-ul">
<li>generic operations with explicit dispatch
<ul class="org-ul">
<li>new type T
<ul class="org-ul">
<li>implement the set of concrete opertaions for type T</li>
<li>update every generic operation with new dispatch branch for type T</li>
<li>add new "generic" constructor for type T</li>
<li>implement constructor for each type S with T<sub>constructure</sub> signature</li>
</ul></li>
<li>new operation P
<ul class="org-ul">
<li>for every type T, add a concrete implementation for P<sub>T</sub></li>
<li>add a new generic operation P that dispatches to concrete operation based on type</li>
</ul></li>
</ul></li>
<li>data-directed programming
<ul class="org-ul">
<li>new type T
<ul class="org-ul">
<li>implement the set of concrete operations for type T and register them in the dispatch table</li>
<li>add a new "generic" constructor for type T</li>
<li>for every type T, implement constructors with the T<sub>constructor</sub> signature</li>
</ul></li>
<li>new operation P
<ul class="org-ul">
<li>for every type T, add a concrete operation P<sub>T</sub> and register it with the dispatch table as 'P</li>
<li>add a new generic opertaion P that simply searches 'P in the dispatch table to locate implementation</li>
</ul></li>
</ul></li>
<li>message passing
<ul class="org-ul">
<li>new type T
<ul class="org-ul">
<li>implement the set of concrete operations for type T under T<sub>constructor</sub></li>
</ul></li>
<li>new operation P
<ul class="org-ul">
<li>for every type T, add a concrete implementation for P<sub>T</sub> (it will automatically be available via apply-generic through 'P)</li>
</ul></li>
</ul></li>
</ul>

<p>
When new types are added often message passing works best.
When new operations are added often, either message passing or data-directed programming works.
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: LMG</p>
<p class="date">Created: 2023-06-23 Fri 14:32</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
